# Слишком Длинные Слова
# ограничение по времени: 1 секунда
# ограничение по памяти: 256 мегабайт

# Иногда некоторые слова, такие как «localization» или «internationalization», настолько длинные, что писать их много раз в одном тексте довольно утомительно.

# Давайте считать слово слишком длинным, если его длина строго больше 10 символов. Все слишком длинные слова должны быть заменены специальным сокращением.

# Это сокращение делается так: мы записываем первую и последнюю букву слова, а между ними пишем количество букв между первой и последней буквами. Это число записывается в десятичной системе и не содержит ведущих нулей.

# Таким образом, «localization» будет записано как «l10n», а «internationalization» будет записано как «i18n».

# Вам предлагается автоматизировать процесс замены слов на сокращения. При этом все слишком длинные слова должны быть заменены сокращением, а слова, которые не слишком длинные, не должны подвергаться никаким изменениям.

# Входные данные

# Первая строка содержит целое число n (1 ≤ n ≤ 100). Каждая из следующих n строк содержит одно слово. Все слова состоят из строчных латинских букв и имеют длину от 1 до 100 символов.

# Выходные данные

# Выведите n строк. i-я строка должна содержать результат замены i-го слова из входных данных.

n = int(input())  # читаем количество слов

for i in range(n):
    word = input()  # читаем каждое слово
    length = len(word)
    
    if length > 10:
        # Сокращаем: первая_буква + количество_букв_между + последняя_буква
        abbreviation = word[0] + str(length - 2) + word[-1]
        print(abbreviation)
    else:
        print(word)  # выводим без измененийd