
# A. Арбуз
# ограничение по времени: 1 секунда
# ограничение по памяти: 64 мегабайта

# Одного жаркого летнего дня Пит и его друг Билли решили купить арбуз. Они выбрали самый большой и спелый, на их взгляд. Арбуз взвесили, и
# весы показали w килограмм. Они помчались домой, умирая от жажды, и решили разделить ягоду, однако столкнулись с трудной задачей.
# Пит и Билли — большие поклонники чётных чисел, поэтому они хотят разделить арбуз так, чтобы обе части весили чётное количество килограмм,
# при этом не обязательно, чтобы части были равны. Мальчики очень устали и хотят начать есть как можно скорее, поэтому ты должен помочь им и
# выяснить, можно ли разделить арбуз так, как они хотят. Разумеется, каждый из них должен получить часть положительного веса.

# Входные данные
# Первая (и единственная) строка ввода содержит целое число w (1 ≤ w ≤ 100) — вес купленного арбуза.

# Выходные данные
# Выведи YES, если мальчики могут разделить арбуз на две части, каждая из которых весит чётное количество килограмм; и NO в противном случае.

# Примеры

# Вход
# text
# 8

# Выход
# text
# YES

w = int (input())

if w % 2 == 0 and w > 2:
    print("YES")
else:
    print("NO")